{
  "tips": [
    {
      "id": "maternal_care_1",
      "category": "Maternal Care",
      "title": "Prenatal Care Essentials",
      "content": "Regular prenatal check-ups are crucial for both mother and baby's health. Visit your healthcare provider monthly during the first 7 months, twice monthly during the 8th month, and weekly during the 9th month.",
      "shortContent": "Regular prenatal check-ups are crucial for both mother and baby's health.",
      "priority": "high"
    },
    {
      "id": "maternal_care_2",
      "category": "Maternal Care",
      "title": "Nutrition During Pregnancy",
      "content": "Eat a balanced diet rich in iron, folic acid, calcium, and protein. Include green leafy vegetables, fruits, dairy products, and lean meats. Take prescribed supplements as recommended by your doctor.",
      "shortContent": "Eat a balanced diet rich in iron, folic acid, calcium, and protein.",
      "priority": "high"
    },
    {
      "id": "maternal_care_3",
      "category": "Maternal Care",
      "title": "Warning Signs During Pregnancy",
      "content": "Seek immediate medical attention if you experience severe headaches, blurred vision, severe abdominal pain, vaginal bleeding, or sudden swelling of hands and face.",
      "shortContent": "Seek immediate medical attention for severe headaches, blurred vision, or vaginal bleeding.",
      "priority": "critical"
    },
    {
      "id": "immunization_1",
      "category": "Immunization",
      "title": "Childhood Vaccination Schedule",
      "content": "Follow the national immunization schedule: BCG at birth, OPV at birth and 6, 10, 14 weeks, DPT at 6, 10, 14 weeks, Measles at 9 months, and MMR at 15 months. Keep vaccination records safe.",
      "shortContent": "Follow the national immunization schedule and keep vaccination records safe.",
      "priority": "high"
    },
    {
      "id": "immunization_2",
      "category": "Immunization",
      "title": "Importance of Vaccination",
      "content": "Vaccines protect children from serious diseases like polio, measles, tetanus, and whooping cough. Vaccination is safe, effective, and free at government health centers.",
      "shortContent": "Vaccines protect children from serious diseases and are safe and effective.",
      "priority": "high"
    },
    {
      "id": "immunization_3",
      "category": "Immunization",
      "title": "Side Effects of Vaccination",
      "content": "Mild side effects like fever, redness, or swelling at injection site are normal. Contact your healthcare provider if symptoms persist or worsen.",
      "shortContent": "Mild side effects like fever or redness are normal after vaccination.",
      "priority": "medium"
    },
    {
      "id": "nutrition_1",
      "category": "Nutrition",
      "title": "Breastfeeding Benefits",
      "content": "Breast milk provides complete nutrition for babies up to 6 months. It contains antibodies that protect against infections and promotes healthy growth and development.",
      "shortContent": "Breast milk provides complete nutrition and protects against infections.",
      "priority": "high"
    },
    {
      "id": "nutrition_2",
      "category": "Nutrition",
      "title": "Complementary Feeding",
      "content": "Start complementary feeding at 6 months while continuing breastfeeding. Begin with soft, mashed foods like rice, dal, and vegetables. Gradually increase variety and texture.",
      "shortContent": "Start complementary feeding at 6 months with soft, mashed foods.",
      "priority": "high"
    },
    {
      "id": "nutrition_3",
      "category": "Nutrition",
      "title": "Iron Deficiency Prevention",
      "content": "Include iron-rich foods like green leafy vegetables, jaggery, dates, and meat in your diet. Take iron supplements as prescribed by your doctor to prevent anemia.",
      "shortContent": "Include iron-rich foods and take supplements to prevent anemia.",
      "priority": "medium"
    },
    {
      "id": "disease_prevention_1",
      "category": "Disease Prevention",
      "title": "Hand Hygiene",
      "content": "Wash hands with soap and water for at least 20 seconds before eating, after using toilet, and after handling waste. This prevents the spread of infections.",
      "shortContent": "Wash hands with soap and water for at least 20 seconds to prevent infections.",
      "priority": "high"
    },
    {
      "id": "disease_prevention_2",
      "category": "Disease Prevention",
      "title": "Safe Water and Sanitation",
      "content": "Drink only boiled or filtered water. Use clean toilets and maintain proper sanitation. This prevents waterborne diseases like diarrhea and cholera.",
      "shortContent": "Drink only boiled or filtered water and maintain proper sanitation.",
      "priority": "high"
    },
    {
      "id": "disease_prevention_3",
      "category": "Disease Prevention",
      "title": "Mosquito Prevention",
      "content": "Use mosquito nets while sleeping, wear long-sleeved clothes, and eliminate standing water around your home to prevent malaria and dengue.",
      "shortContent": "Use mosquito nets and eliminate standing water to prevent malaria and dengue.",
      "priority": "high"
    },
    {
      "id": "general_health_1",
      "category": "General Health",
      "title": "Regular Health Check-ups",
      "content": "Visit your healthcare provider regularly for check-ups, even when you feel healthy. Early detection of health problems leads to better treatment outcomes.",
      "shortContent": "Visit your healthcare provider regularly for check-ups, even when healthy.",
      "priority": "medium"
    },
    {
      "id": "general_health_2",
      "category": "General Health",
      "title": "Mental Health Awareness",
      "content": "Mental health is as important as physical health. Talk to someone if you feel sad, anxious, or overwhelmed. Seek professional help when needed.",
      "shortContent": "Mental health is important. Talk to someone if you feel sad or anxious.",
      "priority": "medium"
    },
    {
      "id": "general_health_3",
      "category": "General Health",
      "title": "Exercise and Physical Activity",
      "content": "Engage in regular physical activity like walking, yoga, or household work. Exercise improves physical and mental health and helps prevent chronic diseases.",
      "shortContent": "Engage in regular physical activity to improve health and prevent diseases.",
      "priority": "medium"
    }
  ]
}